app/controllers/delivery_statuses_controller.rb

  def index
    @delivery_statuses = DeliveryStatus.all
---
SELECT "delivery_statuses".* FROM "delivery_statuses"