app/controllers/payment_types_controller.rb

  def index
    @payment_types = PaymentType.all
---
SELECT "payment_types".* FROM "payment_types"