app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (product_name LIKE '%what is this%' OR description LIKE '%what is this%')
---
  def index
    if params[:searchbox].nil?
      @products = Product.all

INSERT INTO "products" ("product_name", "price", "amount_in_stock", "package_size", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["product_name", "jasmine rice"], ["price", "20.0"], ["amount_in_stock", 100], ["package_size", "10.0"], ["created_at", "2016-04-20 13:31:06.264138"], ["updated_at", "2016-04-20 13:31:06.264138"]]
---
  def create
    params[:product][:product_name].downcase!
    params[:product][:description].downcase!
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "product_unit_id" = $1, "category_id" = $2, "updated_at" = $3 WHERE "products"."id" = $4  [["product_unit_id", 1], ["category_id", 1], ["updated_at", "2016-04-20 13:39:22.951093"], ["id", 1]]
---
  def update

    params[:product][:product_name].downcase!
    params[:product][:description].downcase!
    respond_to do |format|
      if @product.update(product_params)