app/controllers/product_units_controller.rb

SELECT "product_units".* FROM "product_units"
---
  def index
    @product_units = ProductUnit.all

INSERT INTO "product_units" ("product_unit_name", "product_unit_abbreviation", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_unit_name", "kg"], ["product_unit_abbreviation", "kg"], ["created_at", "2016-04-20 12:15:33.421936"], ["updated_at", "2016-04-20 12:15:33.421936"]]
---
  def create
    @product_unit = ProductUnit.new(product_unit_params)

    respond_to do |format|
      if @product_unit.save

SELECT  "product_units".* FROM "product_units" WHERE "product_units"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_product_unit
      @product_unit = ProductUnit.find(params[:id])