app/views/products/_form.html.erb

SELECT "product_units".* FROM "product_units"
---
      <%= f.label :product_unit_id %><br>
      <%= f.collection_select :product_unit_id,ProductUnit.all,:id,:product_unit_name, {:prompt => 'Please select unit of the product'} %>

SELECT "categories".* FROM "categories"
---
      <%= f.label :category_id %><br>
      <%= f.collection_select :category_id,Category.all,:id,:category_name, {:prompt => 'Please select category'} %>